{
              "bi_grams": "[Job Description, Description Java, Java Developer, experienced Java, Java developer, Java development, maintaining enterprise, enterprise level, level applications, possess e, e xcellent, xcellent communication, communication skills, collaborative mindset, fast paced, paced dynamic, dynamic team, team environment, Develop test, maintain Java, Java based, based applications, industry standard, Colla borate, cross functional, functional teams, address business, technical issues, architecture discussions, scalable efficient, secure applications, Write clean, clean efficient, welldocumented code, industry best, code reviews, reviews testing, deployment activities, Continuously improve, Java development, development including, emerging technologies, d frameworks, team members, understand business, deliver solutions, exceed expectations, Computer Science, Science Engineering, related field, lea st, Java development, strong proficiency, Java Spring, Hibernate frameworks, web development, development technologies, HTML CSS, database technologies, Oracle MySQL, SQ L, L Server, Agile development, development methodologies, Strong understanding, software development, development best, best practices, practices including, including object, oriented design, design principles, principles testing, version control, control systems, Excellent written, verbal communicatio, communicatio n, n skills, Strong problem, problem solving, critical thinking, thinking skills, work independently, team environment, Java development, cutting edge, edge technologies, competitive salary, salary comprehensive, comprehensive benefits, benefits package, dynamic work]",
              "clean_data": "Job Description Java Developer  \n \nWe are seeking an experienced Java developer to join our team The ideal \ncandidate should have at least 5 years of experience in Java development with a \nfocus on developing and maintaining enterprise level applications The candidate \nshould also possess e xcellent communication skills and a collaborative mindset \nwith an ability to work in a fast paced dynamic team environment  \n \nResponsibilities  \n \nDevelop test and maintain Java based applications using industry standard \nframeworks and technologies  \nColla borate with cross functional teams to identify and address business \nrequirements and technical issues  \nParticipate in design and architecture discussions to ensure the development of \nscalable efficient and secure applications  \nWrite clean efficient and  welldocumented code that adheres to industry best \npractices and standards  \nParticipate in code reviews testing and deployment activities as required  \nContinuously improve your knowledge and skills in Java development including \nemerging technologies an d frameworks  \nCommunicate with team members and stakeholders to understand business \nrequirements and deliver solutions that meet or exceed expectations  \nRequirements  \n \nBachelor's or Master's degree in Computer Science Engineering or related field  \nAt lea st 5 years of experience in Java development with strong proficiency in \nJava Spring and Hibernate frameworks   Experience with web development technologies such as HTML CSS and \nJavaScript  \nKnowledge of database technologies such as Oracle MySQL or SQ L Server  \nExperience with Agile development methodologies  \nStrong understanding of software development best practices including object \noriented design principles testing and version control systems such as Git  \nExcellent written and verbal communicatio n skills  \nStrong problem solving and critical thinking skills  \nAbility to work independently and collaboratively in a team environment  \nIf you are passionate about Java development and have a desire to work with \ncutting edge technologies and frameworks we  encourage you to apply We offer a \ncompetitive salary comprehensive benefits package and a dynamic work \nenvironment with opportunities for growth and advancement  ",
              "entities": [
                            "Computer Science Engineering",
                            "HTML CSS",
                            "Oracle MySQL or",
                            "SQ L Server",
                            "Git  \nExcellent"
              ],
              "extracted_keywords": [
                            "Job",
                            "Description",
                            "Java",
                            "Developer",
                            "seeking",
                            "experienced",
                            "Java",
                            "developer",
                            "join",
                            "team",
                            "ideal",
                            "candidate",
                            "have",
                            "years",
                            "experience",
                            "Java",
                            "development",
                            "focus",
                            "developing",
                            "maintaining",
                            "enterprise",
                            "level",
                            "applications",
                            "candidate",
                            "possess",
                            "e",
                            "xcellent",
                            "communication",
                            "skills",
                            "collaborative",
                            "mindset",
                            "ability",
                            "work",
                            "paced",
                            "dynamic",
                            "team",
                            "environment",
                            "Responsibilities",
                            "Develop",
                            "test",
                            "maintain",
                            "Java",
                            "based",
                            "applications",
                            "using",
                            "industry",
                            "standard",
                            "frameworks",
                            "technologies",
                            "Colla",
                            "borate",
                            "cross",
                            "functional",
                            "teams",
                            "identify",
                            "address",
                            "business",
                            "requirements",
                            "technical",
                            "issues",
                            "Participate",
                            "design",
                            "architecture",
                            "discussions",
                            "ensure",
                            "development",
                            "scalable",
                            "efficient",
                            "secure",
                            "applications",
                            "Write",
                            "clean",
                            "efficient",
                            "welldocumented",
                            "code",
                            "adheres",
                            "industry",
                            "best",
                            "practices",
                            "standards",
                            "Participate",
                            "code",
                            "reviews",
                            "testing",
                            "deployment",
                            "activities",
                            "required",
                            "improve",
                            "knowledge",
                            "skills",
                            "Java",
                            "development",
                            "including",
                            "emerging",
                            "technologies",
                            "d",
                            "frameworks",
                            "Communicate",
                            "team",
                            "members",
                            "stakeholders",
                            "understand",
                            "business",
                            "requirements",
                            "deliver",
                            "solutions",
                            "meet",
                            "exceed",
                            "expectations",
                            "Requirements",
                            "Bachelor",
                            "Master",
                            "degree",
                            "Computer",
                            "Science",
                            "Engineering",
                            "related",
                            "field",
                            "lea",
                            "st",
                            "years",
                            "experience",
                            "Java",
                            "development",
                            "strong",
                            "proficiency",
                            "Java",
                            "Spring",
                            "Hibernate",
                            "frameworks",
                            "Experience",
                            "web",
                            "development",
                            "technologies",
                            "such",
                            "HTML",
                            "CSS",
                            "JavaScript",
                            "Knowledge",
                            "database",
                            "technologies",
                            "such",
                            "Oracle",
                            "MySQL",
                            "SQ",
                            "L",
                            "Server",
                            "Experience",
                            "Agile",
                            "development",
                            "methodologies",
                            "Strong",
                            "understanding",
                            "software",
                            "development",
                            "best",
                            "practices",
                            "including",
                            "object",
                            "oriented",
                            "design",
                            "principles",
                            "testing",
                            "version",
                            "control",
                            "systems",
                            "such",
                            "Git",
                            "Excellent",
                            "written",
                            "verbal",
                            "communicatio",
                            "skills",
                            "Strong",
                            "problem",
                            "solving",
                            "critical",
                            "thinking",
                            "skills",
                            "Ability",
                            "work",
                            "team",
                            "environment",
                            "passionate",
                            "Java",
                            "development",
                            "have",
                            "desire",
                            "work",
                            "cutting",
                            "edge",
                            "technologies",
                            "frameworks",
                            "encourage",
                            "apply",
                            "offer",
                            "competitive",
                            "salary",
                            "comprehensive",
                            "benefits",
                            "package",
                            "dynamic",
                            "work",
                            "environment",
                            "opportunities",
                            "growth",
                            "advancement"
              ],
              "job_desc_data": "Job Description: Java Developer  \n \nWe are seeking an experienced Java developer to join our team. The ideal \ncandidate should have at least 5 years of experience in Java development, with a \nfocus on developing and maintaining enterprise -level applications. The candidate \nshould also possess e xcellent communication skills and a collaborative mindset, \nwith an ability to work in a fast -paced, dynamic team environment.  \n \nResponsibilities:  \n \nDevelop, test, and maintain Java -based applications using industry -standard \nframeworks and technologies.  \nColla borate with cross -functional teams to identify and address business \nrequirements and technical issues.  \nParticipate in design and architecture discussions to ensure the development of \nscalable, efficient, and secure applications.  \nWrite clean, efficient, and  well-documented code that adheres to industry best \npractices and standards.  \nParticipate in code reviews, testing, and deployment activities as required.  \nContinuously improve your knowledge and skills in Java development, including \nemerging technologies an d frameworks.  \nCommunicate with team members and stakeholders to understand business \nrequirements and deliver solutions that meet or exceed expectations.  \nRequirements:  \n \nBachelor's or Master's degree in Computer Science, Engineering, or related field.  \nAt lea st 5 years of experience in Java development, with strong proficiency in \nJava, Spring, and Hibernate frameworks.   Experience with web development technologies such as HTML, CSS, and \nJavaScript.  \nKnowledge of database technologies such as Oracle, MySQL, or SQ L Server.  \nExperience with Agile development methodologies.  \nStrong understanding of software development best practices, including object -\noriented design principles, testing, and version control systems such as Git.  \nExcellent written and verbal communicatio n skills.  \nStrong problem -solving and critical -thinking skills.  \nAbility to work independently and collaboratively in a team environment.  \nIf you are passionate about Java development and have a desire to work with \ncutting -edge technologies and frameworks, we  encourage you to apply. We offer a \ncompetitive salary, comprehensive benefits package, and a dynamic work \nenvironment with opportunities for growth and advancement.  ",
              "keyterms": [
                            [
                                          "Java development",
                                          0.26919475322747016
                            ],
                            [
                                          "team environment",
                                          0.09941934234511868
                            ],
                            [
                                          "experience",
                                          0.02977637498685747
                            ],
                            [
                                          "application",
                                          0.02379850592847604
                            ],
                            [
                                          "skill",
                                          0.022497177455640515
                            ],
                            [
                                          "technology",
                                          0.021616804020294696
                            ],
                            [
                                          "framework",
                                          0.018326336126746803
                            ],
                            [
                                          "year",
                                          0.01807172297101236
                            ],
                            [
                                          "candidate",
                                          0.014562722583606963
                            ],
                            [
                                          "ability",
                                          0.012715438755893347
                            ],
                            [
                                          "requirement",
                                          0.012405073234017967
                            ],
                            [
                                          "standard",
                                          0.011643052002888876
                            ],
                            [
                                          "industry",
                                          0.011232996235539427
                            ],
                            [
                                          "dynamic",
                                          0.010197178749718634
                            ],
                            [
                                          "business",
                                          0.010027130262939828
                            ],
                            [
                                          "design",
                                          0.009519266187661463
                            ],
                            [
                                          "efficient",
                                          0.008186434398199447
                            ],
                            [
                                          "good",
                                          0.007964469415171026
                            ],
                            [
                                          "practice",
                                          0.007854481690515808
                            ],
                            [
                                          "code",
                                          0.007498641755548127
                            ]
              ],
              "pos_frequencies": {
                            "ADJ": 28,
                            "ADP": 31,
                            "ADV": 7,
                            "AUX": 4,
                            "CCONJ": 29,
                            "DET": 13,
                            "NOUN": 102,
                            "NUM": 2,
                            "PART": 10,
                            "PRON": 9,
                            "PROPN": 39,
                            "SCONJ": 2,
                            "SPACE": 39,
                            "VERB": 38
              },
              "tri_grams": "[Job Description Java, Description Java Developer, seeking an experienced, experienced Java developer, developer to join, join our team, team The ideal, years of experience, experience in Java, focus on developing, developing and maintaining, maintaining enterprise level, enterprise level applications, applications The candidate, possess e xcellent, e xcellent communication, xcellent communication skills, ability to work, fast paced dynamic, paced dynamic team, dynamic team environment, test and maintain, maintain Java based, Java based applications, applications using industry, frameworks and technologies, borate with cross, cross functional teams, teams to identify, identify and address, requirements and technical, Participate in design, design and architecture, discussions to ensure, ensure the development, efficient and secure, Write clean efficient, code that adheres, adheres to industry, practices and standards, Participate in code, code reviews testing, testing and deployment, activities as required, improve your knowledge, knowledge and skills, skills in Java, Java development including, technologies an d, Communicate with team, members and stakeholders, stakeholders to understand, requirements and deliver, solutions that meet, meet or exceed, Master's degree, degree in Computer, Computer Science Engineering, Engineering or related, years of experience, experience in Java, development with strong, Spring and Hibernate, Experience with web, web development technologies, Knowledge of database, MySQL or SQ, SQ L Server, Experience with Agile, Agile development methodologies, understanding of software, software development best, development best practices, best practices including, practices including object, oriented design principles, design principles testing, testing and version, version control systems, written and verbal, verbal communicatio n, communicatio n skills, Strong problem solving, solving and critical, critical thinking skills, Ability to work, independently and collaboratively, passionate about Java, desire to work, cutting edge technologies, technologies and frameworks, apply We offer, competitive salary comprehensive, salary comprehensive benefits, comprehensive benefits package, environment with opportunities, opportunities for growth, growth and advancement]",
              "unique_id": "8d654a81-6425-44fa-985f-54fb9af24236"
}