{
  "resumes": {
    "1": {
      "resume_id": "e2449a20-7719-445f-84fe-300d5ce31c32",
      "content": "Ben Baldut\nSoftware Developer\n\nbenbald21@gmail.com\n\n(+972) 542628546\n\nhttps://www.linkedin.com/in/ben-baldut\n\nAbout Me\n\n• Versatile software developer with hands-on experience with production grade Embedded\n\nSystems with infrastructure integration and automations.\n\n• Quick self-learner interested in taking ownership of problems to build and design modular\n\nmaintainable applications while understanding every layer of the stack.\n\n• Experienced with Image Processing, Low Level Programming, Web Development and Hardware\n\nIntegration.\n\nWork Experience\n\nIDF - Unit 0099 (Hatal)\n\nSoftware Developer\n\n2021-2024\n\n• Led and developed a platform for streaming video for AI edge detection analysis on a jetson\n\nedge device.\n\n• Designed a process for optimizing data handling to performance of real time video feed delivery\n\nby up to 20%.\n\n• Architected independent production level components with end-to-end integration testing of real\n\ntime delivered live feed from an embedded system.\n\n• Integrated OpenCV with GStreamer for an accelerated RTSP feed, to a real time API control\n\nmodel serving a full stack interface.\n\n• Automating data validation for testing media server renewing the streaming feed on failures.\n• Handling data with an asynchronous C++ backend for RabbitMQ message broker.\n• Embedding control logic for video and messaging components into lightweight native desktop\n\nand web applications.\n\n• Integrating microservices component-based architecture with AWS lambdas and EC2 instances\n\nfor automations.\n\nAwards & Recognition\n\nIDF\n\n2022\n\n• Military Excellence Award - Awarded for exceptional conduct and contribution in a high\n\nresponsibility role.\n\nEducation\n\nCyber Education Program - Magshimim\n\n2016-2019\n\n• Taking lessons in “Magshimim” about a variety of programming subjects, including C, C++, OSI\n\nModel, Python, Assembly, Shell, AI and Reverse Engineering.\n\nOrt Yuvaley Ariel\n\n2016-2019\n\n• Graduated with majors in Robotics and Mechanical Engineering, designing and building a\n\nself-made Ardu Pilot Drone with the ability to control and aim in real time\n\nSkills\n\n• Languages: C++, C, Python, JavaScript, TypeScript, Rust, Go\n• Libraries: GStreamer, FFmpeg, OpenCV, NVIDIA Jetson, Yolo, AMQP\n• Tools: Git, RabbitMQ, Docker, Angular, TailwindCSS, Tauri\n\n",
      "content_type": "md",
      "filename": "Ben Baldut - Resume 1.1.2-1.pdf",
      "is_master": true,
      "parent_id": null,
      "processed_data": null,
      "processing_status": "ready",
      "cover_letter": null,
      "outreach_message": null,
      "created_at": "2026-01-21T15:34:02.496881+00:00",
      "updated_at": "2026-01-21T15:34:58.841667+00:00"
    }
  },
  "jobs": {},
  "improvements": {}
}
